afc_saaspro_geo/sample_code/Soap/StreetCityStateZipRequest.xml

<?xml version="1.0" encoding="utf-8"?>
  <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <soap:Header>
      <wsa:Action wsu:Id="Id-da14054c-1dbc-4b00-93b0-7bce4a871336">http://xml.billsoft.com/2006/08/ezgeo/GeocodeAddress</wsa:Action>
      <wsa:MessageID wsu:Id="Id-f8afda7d-1896-4959-8959-f16496b0876a">uuid:bb44bb62-5f2d-46d7-ae7d-2d990487fb72</wsa:MessageID>
      <wsa:ReplyTo wsu:Id="Id-74bb88d8-a533-4476-b9ea-43c003e9b4e3">
        <wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address>
      </wsa:ReplyTo>
      <wsa:To wsu:Id="Id-91324988-7a59-463a-a0fe-8e08cf896d7a">http://ws.billsoft.com/2006/08/EZGeo/LocatorService.asmx</wsa:To>
      <wsse:Security soap:mustUnderstand="1">
        <wsu:Timestamp wsu:Id="Timestamp-25bef8c9-53f3-49f1-bbba-7ff3ddbd4952">
          <wsu:Created>2006-09-01T15:58:36Z</wsu:Created>
          <wsu:Expires>2006-09-01T15:59:36Z</wsu:Expires>
        </wsu:Timestamp>
        <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-c18465b6-553b-413d-b904-70b0f4faaaa7">
          <wsse:Username>testuser</wsse:Username>
          <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">/iuO9MpYhafz234FdgBuUIo7aXk=</wsse:Password>
          <wsse:Nonce>HIFNLDuDI+S8s2smgHWMCA==</wsse:Nonce>
          <wsu:Created>2006-09-01T15:58:36Z</wsu:Created>
        </wsse:UsernameToken>
        <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
          <SignedInfo>
            <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
            <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1" />
            <Reference URI="#Id-da14054c-1dbc-4b00-93b0-7bce4a871336">
              <Transforms>
                <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
              </Transforms>
              <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
              <DigestValue>jmC5xST4xzkiuyhicgF6rFjIaOA=</DigestValue>
            </Reference>
            <Reference URI="#Id-f8afda7d-1896-4959-8959-f16496b0876a">
              <Transforms>
                <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
              </Transforms>
              <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
              <DigestValue>wqJXTop8wIR0z8sa1GFsEdgYWCY=</DigestValue>
            </Reference>
            <Reference URI="#Id-74bb88d8-a533-4476-b9ea-43c003e9b4e3">
              <Transforms>
                <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
              </Transforms>
              <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
              <DigestValue>zxYOYFnLFG9fzWfG0H6pLm810HU=</DigestValue>
            </Reference>
            <Reference URI="#Id-91324988-7a59-463a-a0fe-8e08cf896d7a">
              <Transforms>
                <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
              </Transforms>
              <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
              <DigestValue>9nXqt5+aPAz2LZKVP42dVSvDx/U=</DigestValue>
            </Reference>
            <Reference URI="#Timestamp-25bef8c9-53f3-49f1-bbba-7ff3ddbd4952">
              <Transforms>
                <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
              </Transforms>
              <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
              <DigestValue>xqLhY4dKaAoR2wF746vtZeY/lg0=</DigestValue>
            </Reference>
            <Reference URI="#Id-bb360df0-6665-4f24-ad64-0d978f1d31a2">
              <Transforms>
                <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
              </Transforms>
              <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
              <DigestValue>S6xSxTNz/TCt202WH4GlkHPHxes=</DigestValue>
            </Reference>
          </SignedInfo>
          <SignatureValue>2ryT80/nlecOvCdXmUGGU40hAew=</SignatureValue>
          <KeyInfo>
            <wsse:SecurityTokenReference>
              <wsse:Reference URI="#SecurityToken-c18465b6-553b-413d-b904-70b0f4faaaa7" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#UsernameToken" />
            </wsse:SecurityTokenReference>
          </KeyInfo>
        </Signature>
      </wsse:Security>
    </soap:Header>
    <soap:Body wsu:Id="Id-bb360df0-6665-4f24-ad64-0d978f1d31a2">
      <GeocodeAddress xmlns="http://xml.billsoft.com/2006/08/ezgeo">
        <addressInfo>
          <StreetAddress>10100 West 87th St.</StreetAddress>
          <City>Overland Park</City>
          <State>KS</State>
          <PostalCode>66212</PostalCode>
          <GrammarRule>3</GrammarRule>
          <MinimumScore>0</MinimumScore>
          <MaxCount>0</MaxCount>
          <Options>8</Options>
          <CassCertify>true</CassCertify>
        </addressInfo>
      </GeocodeAddress>
    </soap:Body>
  </soap:Envelope>
